import { ItemType } from '../entities/Items';

const itemsData: ItemType[] = [
  {
    id: 1,
    category: 'художня література',
    ratting: 4,
    stoke: 10,
    isBestseller: true,
    title: '1984 - Джордж Орвелл',
    image:
      'https://content1.rozetka.com.ua/goods/images/big_tile/241506234.jpg',
    price: 100,
    description:
      'Джордж Орвелл (справжнє ім’я — Ерік Артур Блер) — англійський прозаїк, есеїст, журналіст і критик. Його творчість характеризується пронизливою соціальною критикою, опозиційністю до тоталітаризму та відвертою підтримкою демократичних прагнень людства. Автор та популяризатор в політичному дискурсі терміна «холодна війна». «1984» — без сумніву, найвідоміша в світі антиутопія, вперше опублікована в 1949 році. Книга оповідає про життя Вінстона Сміта, низькорангового члена Партії, який розчарований повсякденним життям та всюдисущими очима Партії та її зловісного очільника — Старшого Брата. Старший Брат контролює всі аспекти життя: впровадив спрощений новоговір, намагаючись повністю задушити навіть можливість спротиву системі; криміналізував думкозлочини, щоб люди навіть помислити не сміли про бунт проти влади.  Партія контролює все: що люди читають, говорять, роблять, погрожуючи  відправляти неслухів до страхітливої «кімнати сто один».',
  },
  {
    id: 2,
    category: 'художня література',
    ratting: 3,
    stoke: 25,
    isBestseller: true,
    title: 'Сліди на дорозі - Ананьєв В.В.',
    image: 'https://content1.rozetka.com.ua/goods/images/big/14276335.jpg',
    price: 148,
    description:
      'Унікальна жива книга! Перша жива книга про війну на Сході України. Ти, шановний читачу, відчуєш, як у твоє БМД влучає РПГ, ти будеш намагатися допомогти пораненому товаришу, ти відчуєш атмосферу напруги, знаходячись в оточенні, ти будеш читати справжній лист дівчини своєму коханому на фронт. І для цього тобі потрібна лише книга Сліди на дорозі та смартфон. Близько 100 QR кодів розставлені по тексту, дозволять вам поринути у події, описані в книзі. Ви зможете побачити на своєму смартфоні оригінальні відео та фотоматеріали реальних подій, що описані в книзі. Жодної постанови, увесь матеріал був знятий на фронті в 2014 році. Пориньте у життя головного героя з головою, відчуйте книгу своєю душею.',
  },
  {
    id: 3,
    category: 'художня література',
    ratting: 5,
    stoke: 0,
    isBestseller: false,
    title: 'Тисяча пам&apos;ятних поцілунків - Тіллі Коул',
    image: 'https://content.rozetka.com.ua/goods/images/big/281995717.jpg',
    price: 229,
    description:
      'Чи може кохання тривати вічно, попри перешкоди, відстань і час? Це можливо, якщо поєднуються дві половинки одного серця. Руну п’ять, він із батьками щойно переїхав із рідної Норвегії до маленького містечка американського штату Джорджія і дуже засмучений через це. Та відколи він знайомиться з дивакуватою сусідкою Поппі, його життя набуває яскравих кольорів і перетворюється на справжню пригоду. Поппі, виконуючи заповіт улюбленої бабусі, має на меті зібрати тисячу поцілунків, але не звичайних, а особливих, таких, коли серце мало не вистрибуватиме з грудей. Саме такі поцілунки обіцяє їй подарувати Рун. Історія кохання, яка розіб’є вам серце.',
  },
  {
    id: 4,
    category: 'художня література',
    ratting: 4,
    stoke: 10,
    isBestseller: false,
    title: 'Маленький принц - Антуан де-Сент Екзюпері',
    image: 'https://content.rozetka.com.ua/goods/images/big/216604502.jpg',
    price: 115,
    description:
      'Коли я лечу серед зірок і бачу вдалині вогники, я кажу собі, що це моя маленька Консуело кличе мене...» — писав Антуан де Сент-Екзюпері про свою любов до дружини. Саме витончена Консуэла Сунсін і стала прообразом прекрасної Троянди зі знаменитої на весь світ книги видатного французького письменника, поета й льотчика «Маленький принц». Книги, яка стала справжнім бестселером ХХ століття. Ілюстрації автора, чорно-білі',
  },
  {
    id: 5,
    category: 'бізнес розвиваюча література',
    ratting: 5,
    stoke: 0,
    isBestseller: true,
    title: 'Will. Вілл - Вілл Сміт, Марк Менсон',
    image: 'https://content2.rozetka.com.ua/goods/images/big/241578726.jpg',
    price: 199,
    description:
      'У цій відвертій і захопливій книжці один із найдинамічніших і найвідоміших артистів сьогодення розповідає про свій шлях до успіху, щастя та внутрішньої гармонії — про те, як звичайний хлопець Вілл Сміт із Західної Філадельфії перетворився на одну з найяскравіших зірок спершу на музичному небосхилі, а потім і в кіноіндустрії. Утім ця епічна історія має й зворотний бік: ставши одним із найкасовіших акторів сучасності, Вілл Сміт був переконаний, що його безпрецедентний успіх зробить щасливим не лише його, а й усіх навколо нього. Та не так сталося, як гадалося. Підписавшись на життя, якого навіть не бажали, близькі Вілла почувалися не родиною, а артистами на арені його яскравого голлівудського цирку. Виявилося, Віллові Сміту ще багато чому слід навчитися. Особиста подорож актора до глибин самопізнання й усвідомленості вилилася на сторінки цих дивовижних мемуарів, які написано в тандемі з Марком Менсоном, автором бестселера «Витончене мистецтво забивати на все». «Вілл» — це щира сповідь про шлях до опанування власними емоціями, що допоможе кожному читачеві ліпше зрозуміти самого себе та свій внутрішній світ. Мало кому з нас відомо, якого тиску зазнають голлівудські знаменитості, коли їхнє життя стає надбанням громадськості, однак кожен із нас має збагнути, що паливо, яке живить тебе на одному етапі твого життя, може виявитися абсолютно недієвим на наступному. Поєднання глибокої мудрості, цінних порад і захопливого стилю робить цю книжку, як і її автора, унікальними у своїй категорії',
  },
  {
    id: 6,
    category: 'бізнес розвиваюча література',
    ratting: 5,
    stoke: 0,
    isBestseller: false,
    title:
      'Конкуренція за доби штучного інтелекту - Марко Янсіті, Карім Лахані',
    image: 'https://content.rozetka.com.ua/goods/images/big/163319472.jpg',
    price: 199,
    description:
      'Настає нова ера — доба штучного інтелекту, яка створює амбітні виклики для бізнесу. Компанії, осердям яких стали масиви даних, аналітика й алгоритми машинного навчання, вириваються вперед і нівелюють традиційні проблеми, що стримують зростання. Від Airbnb до Ant Financial, від Microsoft до Amazon — дослідження доводять, що процеси, засновані на штучному інтелекті, сприяють небаченому масштабуванню та подоланню міжгалузевих меж. З книги ви дізнаєтеся про зіткнення архітектур традиційних і цифрових компаній, нові виклики для керівників і ризики змін бізнес-моделей на основі ШІ.',
  },
  {
    id: 7,
    category: 'бізнес розвиваюча література',
    ratting: 5,
    stoke: 0,
    isBestseller: false,
    title: 'Вселенная Стивена Хокинга. Три книги о пространстве и времени',
    image: 'https://content2.rozetka.com.ua/goods/images/big/301864161.jpg',
    price: 275,
    description:
      'В настоящее издание вошли три научно-популярных бестселлера выдающегося физика современности Стивена Хокинга, в которых он увлекательно и доступно рассказывает о природе пространства и времени, о происхождении Вселенной и ее возможной судьбе. ',
  },
  {
    id: 8,
    category: 'бізнес розвиваюча література',
    ratting: 5,
    stoke: 0,
    isBestseller: true,
    title: 'Айзексон Уолтер. Стів Джобс. Біографія. ',
    image: 'https://content1.rozetka.com.ua/goods/images/big/268071547.jpg',
    price: 439,
    description:
      'Книга "Стів Джобс. Біографія" - перша та єдина офіційна біографія Стіва Джобса, написана за його повного сприяння. Волтер Айзексон (Walter Isaacson) - американський журналіст, письменник та біограф; автор відомих біографій Бенджамена Франкліна та Альберта Ейнштейна. Президент та голова інституту Аспена. Був головою корпорації CNN та головним редактором журналу Time. Стів Джобс (Steve Jobs) - американський підприємець і винахідник. Спільно зі Стівом Возняком заснував корпорацію корпр Джобс був головою ради директорів та CEO корпорації Apple. Раніше він обіймав посаду CEO компанії Pixar Animation Studios. Коли The Walt Disney Company придбав Pixar, Джобс став членом ради директорів Disney. Його називали босом століття. Джобса одночасно звеличували і критикували за неперевершену майстерність переконання та вміння продавати, яке охрестили "полем спотворення реальності". За два роки Айзексон взяв понад 40 інтервю у самого Джобса, а також провів бесіди з його родичами, колегами, суперниками, друзями та ворогами, які склали основу біографії. Джобс надав автору творчої свободи. Він відверто відповідав на всі запитання і чекав такої самої чесності від інших. Стів Джобс. Біографія - це портрет одного з бізнес-лідерів нашого часу. Книга є докладною розповіддю про життя Джобса – про його дитинство, заняття буддизмом, історію компанії Pixar, про те, як зароджувалася і розвивалася корпорація Apple. Це розповідь про падіння та зльоти, про сильну людину та талановитого бізнесмена. Креативність, інновації  ',
  },
];

export default itemsData;
